espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Registers */
/** Type of blend0_clut_data register
 *  CLUT sram data read/write register in background plane of blender
 */
typedef union {
    struct {
        /** rdwr_word_blend0_clut : R/W; bitpos: [31:0]; default: 0;
         *  Write and read data to/from CLUT RAM in background plane of blender engine through
         *  this field in fifo mode.
         */
        uint32_t rdwr_word_blend0_clut:32;
    };
    uint32_t val;
} ppa_blend0_clut_data_reg_t;

/** Type of blend1_clut_data register
 *  CLUT sram data read/write register in foreground plane of blender
 */
typedef union {
    struct {
        /** rdwr_word_blend1_clut : R/W; bitpos: [31:0]; default: 0;
         *  Write and read data to/from CLUT RAM in foreground plane of blender engine through
         *  this field in fifo mode.
         */
        uint32_t rdwr_word_blend1_clut:32;
    };
    uint32_t val;
} ppa_blend1_clut_data_reg_t;

/** Type of clut_conf register
 *  CLUT configure register
 */
typedef union {
    struct {
        /** apb_fifo_mask : R/W; bitpos: [0]; default: 0;
         *  1'b0: fifo mode to wr/rd clut0/clut1 RAM through register
         *  PPA_BLEND0_CLUT_DATA_REG/PPA_BLEND1_CLUT_DATA_REG. 1'b1:
         *  memory mode to wr/rd blend0/blend1 clut RAM. The bit 11 and 10 of the waddr
         *  should be 01 to access blend0 clut and should be 10 to access blend1 clut in memory mode.
         */
        uint32_t apb_fifo_mask:1;
        /** blend0_clut_mem_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 then write 0 to this bit to reset BLEND0 CLUT.
         */
        uint32_t blend0_clut_mem_rst:1;
        /** blend1_clut_mem_rst : R/W; bitpos: [2]; default: 0;
         *  Write 1 then write 0 to this bit to reset BLEND1 CLUT.
         */
        uint32_t blend1_clut_mem_rst:1;
        /** blend0_clut_mem_rdaddr_rst : R/W; bitpos: [3]; default: 0;
         *  Write 1 then write 0 to reset the read address of BLEND0 CLUT in fifo mode.
         */
        uint32_t blend0_clut_mem_rdaddr_rst:1;
        /** blend1_clut_mem_rdaddr_rst : R/W; bitpos: [4]; default: 0;
         *  Write 1 then write 0 to reset the read address of BLEND1 CLUT in fifo mode.
         */
        uint32_t blend1_clut_mem_rdaddr_rst:1;
        /** blend_clut_mem_force_pd : R/W; bitpos: [5]; default: 0;
         *  1: force power down BLEND CLUT memory.
         */
        uint32_t blend_clut_mem_force_pd:1;
        /** blend_clut_mem_force_pu : R/W; bitpos: [6]; default: 0;
         *  1: force power up BLEND CLUT memory.
         */
        uint32_t blend_clut_mem_force_pu:1;
        /** blend_clut_mem_clk_ena : R/W; bitpos: [7]; default: 0;
         *  1: Force clock on for BLEND CLUT memory.
         */
        uint32_t blend_clut_mem_clk_ena:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} ppa_clut_conf_reg_t;

/** Type of sr_color_mode register
 *  Scaling and rotating engine color mode register
 */
typedef union {
    struct {
        /** sr_rx_cm : R/W; bitpos: [3:0]; default: 0;
         *  The source image color mode for Scaling and Rotating engine Rx. 0: ARGB8888. 1:
         *  RGB888. 2: RGB565. 8: YUV420. 9: YUV422. 12: GRAY. others: Reserved.
         */
        uint32_t sr_rx_cm:4;
        /** sr_tx_cm : R/W; bitpos: [7:4]; default: 0;
         *  The destination image color mode for Scaling and Rotating engine Tx. 0: ARGB8888.
         *  1: RGB888. 2: RGB565. 8: YUV420. 9: YUV422. 12: GRAY. others: Reserved.
         */
        uint32_t sr_tx_cm:4;
        /** yuv_rx_range : R/W; bitpos: [8]; default: 0;
         *  YUV input range when reg_sr_rx_cm is 4'd8. 0: limit range. 1: full range
         */
        uint32_t yuv_rx_range:1;
        /** yuv_tx_range : R/W; bitpos: [9]; default: 0;
         *  YUV output range when reg_sr_tx_cm is 4'd8. 0: limit range. 1: full range
         */
        uint32_t yuv_tx_range:1;
        /** yuv2rgb_protocol : R/W; bitpos: [10]; default: 0;
         *  YUV to RGB protocol when reg_sr_rx_cm is 4'd8. 0: BT601. 1: BT709
         */
        uint32_t yuv2rgb_protocol:1;
        /** rgb2yuv_protocol : R/W; bitpos: [11]; default: 0;
         *  RGB to YUV protocol when reg_sr_tx_cm is 4'd8. 0: BT601. 1: BT709
         */
        uint32_t rgb2yuv_protocol:1;
        /** yuv422_rx_byte_order : R/W; bitpos: [13:12]; default: 0;
         *  YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY
         */
        uint32_t yuv422_rx_byte_order:2;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} ppa_sr_color_mode_reg_t;

/** Type of blend_color_mode register
 *  blending engine color mode register
 */
typedef union {
    struct {
        /** blend0_rx_cm : R/W; bitpos: [3:0]; default: 0;
         *  The source image color mode for background plane. 0: ARGB8888. 1: RGB888. 2:
         *  RGB565. 3: Reserved. 4: L8. 5: L4. 8: YUV420. 9: YUV422. 12:GRAY
         */
        uint32_t blend0_rx_cm:4;
        /** blend1_rx_cm : R/W; bitpos: [7:4]; default: 0;
         *  The source image color mode for foreground plane. 0: ARGB8888. 1: RGB888. 2:
         *  RGB565. 3: Reserved. 4: L8. 5: L4. 6: A8. 7: A4.
         */
        uint32_t blend1_rx_cm:4;
        /** blend_tx_cm : R/W; bitpos: [11:8]; default: 0;
         *  The destination image color mode for output of blender. 0: ARGB8888. 1: RGB888. 2:
         *  RGB565. 3: Reserved. 8: YUV420. 9: YUV422. 12:GRAY
         */
        uint32_t blend_tx_cm:4;
        /** blend0_rx_yuv_range : R/W; bitpos: [12]; default: 0;
         *  YUV input range when blend0 rx cm is yuv. 0: limit range. 1: full range
         */
        uint32_t blend0_rx_yuv_range:1;
        /** blend_tx_yuv_range : R/W; bitpos: [13]; default: 0;
         *  YUV output range when blend tx cm is yuv. 0: limit range. 1: full range
         */
        uint32_t blend_tx_yuv_range:1;
        /** blend0_rx_yuv2rgb_protocol : R/W; bitpos: [14]; default: 0;
         *  YUV to RGB protocol when blend0 rx cm is yuv. 0: BT601. 1: BT709
         */
        uint32_t blend0_rx_yuv2rgb_protocol:1;
        /** blend_tx_rgb2yuv_protocol : R/W; bitpos: [15]; default: 0;
         *  RGB to YUV protocol when blend tx cm is yuv. 0: BT601. 1: BT709
         */
        uint32_t blend_tx_rgb2yuv_protocol:1;
        /** blend0_rx_yuv422_byte_order : R/W; bitpos: [17:16]; default: 0;
         *  YUV422 input byte order when reg_sr_rx_cm is 4'd9. 0: YVYU, 1:YUYV, 2: VYUY, 3: UYVY
         */
        uint32_t blend0_rx_yuv422_byte_order:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ppa_blend_color_mode_reg_t;

/** Type of sr_byte_order register
 *  Scaling and rotating engine byte order register
 */
typedef union {
    struct {
        /** sr_rx_byte_swap_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in byte. The Byte0
         *  and Byte1 would be swapped while byte 2 and byte 3 would be swappped.
         */
        uint32_t sr_rx_byte_swap_en:1;
        /** sr_rx_rgb_swap_en : R/W; bitpos: [1]; default: 0;
         *  Set this bit to 1  the data into Rx channel 0 would be swapped in rgb. It means rgb
         *  would be swap to bgr.
         */
        uint32_t sr_rx_rgb_swap_en:1;
        /** sr_macro_bk_ro_bypass : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to bypass the macro block order function. This function is used
         *  to improve efficient accessing external memory.
         */
        uint32_t sr_macro_bk_ro_bypass:1;
        /** sr_bk_size_sel : R/W; bitpos: [3]; default: 0;
         *  sel srm pix_blk size, 0:32x32, 1:16x16
         */
        uint32_t sr_bk_size_sel:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_sr_byte_order_reg_t;

