espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_struct.h
/** Type of eco_low register
 *  Reserved.
 */
typedef union {
    struct {
        /** rnd_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  Reserved.
         */
        uint32_t rnd_eco_low:32;
    };
    uint32_t val;
} ppa_eco_low_reg_t;

/** Type of eco_high register
 *  Reserved.
 */
typedef union {
    struct {
        /** rnd_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  Reserved.
         */
        uint32_t rnd_eco_high:32;
    };
    uint32_t val;
} ppa_eco_high_reg_t;

/** Type of sram_ctrl register
 *  PPA SRAM Control Register
 */
typedef union {
    struct {
        /** mem_aux_ctrl : R/W; bitpos: [13:0]; default: 4896;
         *  Control signals
         */
        uint32_t mem_aux_ctrl:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} ppa_sram_ctrl_reg_t;


/** Group: Interrupt Registers */
/** Type of int_raw register
 *  Raw status interrupt
 */
typedef union {
    struct {
        /** sr_eof_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when scaling and rotating engine
         *  calculate one frame image.
         */
        uint32_t sr_eof_int_raw:1;
        /** blend_eof_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when blending engine calculate one frame
         *  image.
         */
        uint32_t blend_eof_int_raw:1;
        /** sr_param_cfg_err_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when the configured scaling and rotating
         *  coefficient is wrong. User can check the reasons through register
         *  PPA_SR_PARAM_ERR_ST_REG.
         */
        uint32_t sr_param_cfg_err_int_raw:1;
        /** blend_param_cfg_err_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when the configured blending coefficient
         *  is wrong. User can check the reasons through register PPA_BLEND_ST_REG.
         */
        uint32_t blend_param_cfg_err_int_raw:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_int_raw_reg_t;

/** Type of int_st register
 *  Masked interrupt
 */
typedef union {
    struct {
        /** sr_eof_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the PPA_SR_EOF_INT interrupt.
         */
        uint32_t sr_eof_int_st:1;
        /** blend_eof_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the PPA_BLEND_EOF_INT interrupt.
         */
        uint32_t blend_eof_int_st:1;
        /** sr_param_cfg_err_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the PPA_SR_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t sr_param_cfg_err_int_st:1;
        /** blend_param_cfg_err_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t blend_param_cfg_err_int_st:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_int_st_reg_t;

/** Type of int_ena register
 *  Interrupt enable bits
 */
typedef union {
    struct {
        /** sr_eof_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the PPA_SR_EOF_INT interrupt.
         */
        uint32_t sr_eof_int_ena:1;
        /** blend_eof_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the PPA_BLEND_EOF_INT interrupt.
         */
        uint32_t blend_eof_int_ena:1;
        /** sr_param_cfg_err_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the PPA_SR_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t sr_param_cfg_err_int_ena:1;
        /** blend_param_cfg_err_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t blend_param_cfg_err_int_ena:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_int_ena_reg_t;

/** Type of int_clr register
 *  Interrupt clear bits
 */
typedef union {
    struct {
        /** sr_eof_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the PPA_SR_EOF_INT interrupt.
         */
        uint32_t sr_eof_int_clr:1;
        /** blend_eof_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the PPA_BLEND_EOF_INT interrupt.
         */
        uint32_t blend_eof_int_clr:1;
        /** sr_param_cfg_err_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the PPA_SR_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t sr_param_cfg_err_int_clr:1;
        /** blend_param_cfg_err_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the PPA_BLEND_PARAM_CFG_ERR_INT interrupt.
         */
        uint32_t blend_param_cfg_err_int_clr:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} ppa_int_clr_reg_t;


/** Group: Status Registers */
/** Type of clut_cnt register
 *  BLEND CLUT write counter register
 */
typedef union {
    struct {
        /** blend0_clut_cnt : RO; bitpos: [8:0]; default: 0;
         *  The write data counter of BLEND0 CLUT in fifo mode.
         */
        uint32_t blend0_clut_cnt:9;
        /** blend1_clut_cnt : RO; bitpos: [17:9]; default: 0;
         *  The write data counter of BLEND1 CLUT in fifo mode.
         */
        uint32_t blend1_clut_cnt:9;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} ppa_clut_cnt_reg_t;

/** Type of blend_st register
 *  Blending engine status register
 */
typedef union {
    struct {
        /** blend_size_diff_st : RO; bitpos: [0]; default: 0;
         *  1: indicate the size of two image is different.
         */
        uint32_t blend_size_diff_st:1;
        /** blend_yuv_x_scale_err_st : RO; bitpos: [1]; default: 0;
         *  Represents that x param is an odd num when enable yuv422 or yuv420
         */
        uint32_t blend_yuv_x_scale_err_st:1;
        /** blend_yuv_y_scale_err_st : RO; bitpos: [2]; default: 0;
         *  Represents that y param is an odd num when enable yuv420
         */
        uint32_t blend_yuv_y_scale_err_st:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} ppa_blend_st_reg_t;

/** Type of sr_param_err_st register
 *  Scaling and rotating coefficient error register
 */
typedef union {
    struct {
        /** tx_dscr_vb_err_st : RO; bitpos: [0]; default: 0;
         *  The error is that the scaled VB plus the offset of Y coordinate in 2DDMA receive
         *  descriptor is larger than VA in 2DDMA receive descriptor.
         */
        uint32_t tx_dscr_vb_err_st:1;
        /** tx_dscr_hb_err_st : RO; bitpos: [1]; default: 0;
         *  The error is that the scaled HB plus the offset of X coordinate in 2DDMA receive
         *  descriptor is larger than HA in 2DDMA receive descriptor.
         */
        uint32_t tx_dscr_hb_err_st:1;
        /** y_rx_scal_equal_0_err_st : RO; bitpos: [2]; default: 0;
         *  The error is that the PPA_SR_SCAL_Y_INT and PPA_SR_CAL_Y_FRAG both are 0.
         */
        uint32_t y_rx_scal_equal_0_err_st:1;
        /** rx_dscr_vb_err_st : RO; bitpos: [3]; default: 0;
         *  The error is that VB in 2DDMA receive descriptor plus the offset of Y coordinate in
         *  2DDMA transmit descriptor is larger than VA in 2DDMA transmit descriptor
         */
        uint32_t rx_dscr_vb_err_st:1;
        /** ydst_len_too_samll_err_st : RO; bitpos: [4]; default: 0;
         *  The error is that the scaled image width is 0. For example.  when source width is
         *  14. scaled value is 1/16. and no rotate operation. then scaled width would be 0 as
         *  the result would be floored.
         */
        uint32_t ydst_len_too_samll_err_st:1;
        /** ydst_len_too_large_err_st : RO; bitpos: [5]; default: 0;
         *  The error is that the scaled width is larger than (2^13 - 1).
         */
        uint32_t ydst_len_too_large_err_st:1;
        /** x_rx_scal_equal_0_err_st : RO; bitpos: [6]; default: 0;
         *  The error is that the scaled image height is 0.
         */
        uint32_t x_rx_scal_equal_0_err_st:1;
        /** rx_dscr_hb_err_st : RO; bitpos: [7]; default: 0;
         *  The error is that the HB in 2DDMA transmit descriptor plus the offset of X
         *  coordinate in 2DDMA transmit descriptor is larger than HA in 2DDMA transmit
         *  descriptor.
         */
        uint32_t rx_dscr_hb_err_st:1;
        /** xdst_len_too_samll_err_st : RO; bitpos: [8]; default: 0;
         *  The error is that the scaled image height is 0. For example.  when source height is
         *  14. scaled value is 1/16. and no rotate operation. then scaled height would be 0 as
         *  the result would be floored.
         */
        uint32_t xdst_len_too_samll_err_st:1;
        /** xdst_len_too_large_err_st : RO; bitpos: [9]; default: 0;
         *  The error is that the scaled image height is larger than (2^13 - 1).
         */
        uint32_t xdst_len_too_large_err_st:1;
        /** x_yuv420_rx_scale_err_st : RO; bitpos: [10]; default: 0;
         *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
         *  yuv422 or yuv420 rx
         */
        uint32_t x_yuv420_rx_scale_err_st:1;
        /** y_yuv420_rx_scale_err_st : RO; bitpos: [11]; default: 0;
         *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
         *  yuv420 rx
         */
        uint32_t y_yuv420_rx_scale_err_st:1;
        /** x_yuv420_tx_scale_err_st : RO; bitpos: [12]; default: 0;
         *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
         *  yuv422 or yuv420 tx
         */
        uint32_t x_yuv420_tx_scale_err_st:1;
        /** y_yuv420_tx_scale_err_st : RO; bitpos: [13]; default: 0;
         *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
         *  yuv420 tx
         */
        uint32_t y_yuv420_tx_scale_err_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} ppa_sr_param_err_st_reg_t;

