espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ppa_struct.h
/** Type of sr_status register
 *  SR FSM register
 */
typedef union {
    struct {
        /** sr_rx_dscr_sample_state : RO; bitpos: [1:0]; default: 0;
         *  Reserved.
         */
        uint32_t sr_rx_dscr_sample_state:2;
        /** sr_rx_scan_state : RO; bitpos: [3:2]; default: 0;
         *  Reserved.
         */
        uint32_t sr_rx_scan_state:2;
        /** sr_tx_dscr_sample_state : RO; bitpos: [5:4]; default: 0;
         *  Reserved.
         */
        uint32_t sr_tx_dscr_sample_state:2;
        /** sr_tx_scan_state : RO; bitpos: [8:6]; default: 0;
         *  Reserved.
         */
        uint32_t sr_tx_scan_state:3;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} ppa_sr_status_reg_t;

/** Type of eco_cell_ctrl register
 *  Reserved.
 */
typedef union {
    struct {
        /** rdn_result : RO; bitpos: [0]; default: 0;
         *  Reserved.
         */
        uint32_t rdn_result:1;
        /** rdn_ena : R/W; bitpos: [1]; default: 0;
         *  Reserved.
         */
        uint32_t rdn_ena:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} ppa_eco_cell_ctrl_reg_t;


/** Group: Debug Register */
/** Type of debug_ctrl0 register
 *  debug register
 */
typedef union {
    struct {
        /** dbg_replace_sel : R/W; bitpos: [2:0]; default: 0;
         *  Configures the data replace location. 0: not replace, 1: srm rx input, 2: srm rx
         *  bilin interpolation, 3: srm tx output, 4: blend fg input, 5: blend bg input, 6:
         *  blend output
         */
        uint32_t dbg_replace_sel:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} ppa_debug_ctrl0_reg_t;

/** Type of debug_ctrl1 register
 *  debug register
 */
typedef union {
    struct {
        /** dbg_replace_data : R/W; bitpos: [31:0]; default: 0;
         *  Configures the replace data
         */
        uint32_t dbg_replace_data:32;
    };
    uint32_t val;
} ppa_debug_ctrl1_reg_t;


/** Group: Configuration Register */
/** Type of rgb2gray register
 *  rgb2gray register
 */
typedef union {
    struct {
        /** rgb2gray_b : R/W; bitpos: [7:0]; default: 85;
         *  Configures the b parameter for rgb2gray
         */
        uint32_t rgb2gray_b:8;
        /** rgb2gray_g : R/W; bitpos: [15:8]; default: 86;
         *  Configures the g parameter for rgb2gray
         */
        uint32_t rgb2gray_g:8;
        /** rgb2gray_r : R/W; bitpos: [23:16]; default: 85;
         *  Configures the r parameter for rgb2gray
         */
        uint32_t rgb2gray_r:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} ppa_rgb2gray_reg_t;


/** Group: Version Register */
/** Type of date register
 *  PPA Version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 539234848;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} ppa_date_reg_t;


typedef struct ppa_dev_t {
    volatile ppa_blend0_clut_data_reg_t blend0_clut_data;
    volatile ppa_blend1_clut_data_reg_t blend1_clut_data;
    uint32_t reserved_008;
    volatile ppa_clut_conf_reg_t clut_conf;
    volatile ppa_int_raw_reg_t int_raw;
    volatile ppa_int_st_reg_t int_st;
    volatile ppa_int_ena_reg_t int_ena;
    volatile ppa_int_clr_reg_t int_clr;
    volatile ppa_sr_color_mode_reg_t sr_color_mode;
    volatile ppa_blend_color_mode_reg_t blend_color_mode;
    volatile ppa_sr_byte_order_reg_t sr_byte_order;
    volatile ppa_blend_byte_order_reg_t blend_byte_order;
    uint32_t reserved_030;
    volatile ppa_blend_trans_mode_reg_t blend_trans_mode;
    volatile ppa_sr_fix_alpha_reg_t sr_fix_alpha;
    volatile ppa_blend_tx_size_reg_t blend_tx_size;
    volatile ppa_blend_fix_alpha_reg_t blend_fix_alpha;
    uint32_t reserved_044;
    volatile ppa_blend_rgb_reg_t blend_rgb;
    volatile ppa_blend_fix_pixel_reg_t blend_fix_pixel;
    volatile ppa_ck_fg_low_reg_t ck_fg_low;
    volatile ppa_ck_fg_high_reg_t ck_fg_high;
    volatile ppa_ck_bg_low_reg_t ck_bg_low;
    volatile ppa_ck_bg_high_reg_t ck_bg_high;
    volatile ppa_ck_default_reg_t ck_default;
    volatile ppa_sr_scal_rotate_reg_t sr_scal_rotate;
    volatile ppa_sr_mem_pd_reg_t sr_mem_pd;
    volatile ppa_reg_conf_reg_t reg_conf;
    volatile ppa_clut_cnt_reg_t clut_cnt;
    volatile ppa_blend_st_reg_t blend_st;
    volatile ppa_sr_param_err_st_reg_t sr_param_err_st;
    volatile ppa_sr_status_reg_t sr_status;
    volatile ppa_eco_low_reg_t eco_low;
    volatile ppa_eco_high_reg_t eco_high;
    volatile ppa_eco_cell_ctrl_reg_t eco_cell_ctrl;
    volatile ppa_sram_ctrl_reg_t sram_ctrl;
    volatile ppa_debug_ctrl0_reg_t debug_ctrl0;
    volatile ppa_debug_ctrl1_reg_t debug_ctrl1;
    volatile ppa_rgb2gray_reg_t rgb2gray;
    uint32_t reserved_09c[25];
    volatile ppa_date_reg_t date;
} ppa_dev_t;

extern ppa_dev_t PPA;

#ifndef __cplusplus
_Static_assert(sizeof(ppa_dev_t) == 0x104, "Invalid size of ppa_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
